---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.Abbreviation
source: html/6f21688c-b2b7-ad78-70a1-3f1de36eab18.htm
---
# Autodesk.Revit.DB.MEPSystemType.Abbreviation Property

Identifies the abbreviation, the short name, for the system type

## Syntax (C#)
```csharp
public string Abbreviation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null